<script setup lang="ts">
const links = [
  {label:'Главная',url:'/'},
  {label:'О нас',url:'/'},
  {label:'Оплата и доставка',url:'/'},
  {label:'Услуги',url:'/'},
  {label:'Статьи',url:'/'},
  {label:'Контакты',url:'/'},
]
</script>

<template>
  <div class="container">
    <header class="text-gray-300 relative z-10">
      <div class="flex items-center justify-between py-6">
        <div class="flex gap-4 ">
          <nuxt-link :to="link.url" v-for="link in links">{{link.label}}</nuxt-link>
        </div>
        <div class="flex gap-4 ">
          <p> Москва</p>
          <a href="tel:+7 495 008 88-81">+7 495 008 88-81</a>
          <p> Круглосуточно 24/7</p>
        </div>
      </div>
      <div class="flex items-center justify-between gap-4">
        <nuxt-link to="/">
          <svg width="187" height="48" viewBox="0 0 187 48" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M32.2327 31.9897L49.0789 2.1546H64.283L40.5646 45.787H23.536L0 2.1546H16.2988L32.2327 31.9897Z" fill="#FF550A"/>
            <path d="M97.9339 19.8434C101.907 19.8434 105.374 20.1186 108.334 20.6689C111.334 21.1799 113.827 22.3002 115.814 24.0298C117.841 25.7593 118.855 28.2751 118.855 31.577C118.855 37.6698 116.057 41.7972 110.462 43.9591C104.908 46.0818 98.6637 47.1431 91.7306 47.1431C84.8381 47.1431 78.4524 46.0621 72.5735 43.9002C66.6945 41.6989 63.7551 37.5322 63.7551 31.4001L79.2633 31.3411C79.2633 34.0534 80.5201 35.783 83.0339 36.5299C85.5882 37.2374 88.5682 37.5912 91.9739 37.5912C95.1769 37.5912 97.9137 37.1391 100.184 36.235C102.495 35.3309 103.651 33.8569 103.651 31.8128V31.7539C103.651 30.6139 102.941 29.7688 101.522 29.2185C100.103 28.6682 98.5826 28.334 96.9609 28.2161C95.3391 28.0982 93.393 28.0196 91.1225 27.9803H86.5612C82.1825 27.9803 78.3713 27.7248 75.1278 27.2137C71.9248 26.6634 69.2286 25.4842 67.0392 23.676C64.8498 21.8678 63.7551 19.1948 63.7551 15.6571C63.7551 9.52494 66.5932 5.53513 72.2694 3.68763C77.9861 1.80082 84.4732 0.857422 91.7306 0.857422C98.5421 0.857422 104.766 1.9384 110.401 4.10037C116.037 6.26234 118.855 10.429 118.855 16.6005H103.59C103.59 14.635 102.434 13.1806 100.123 12.2372C97.8528 11.2545 95.0756 10.7042 91.7915 10.5863C88.2641 10.5863 85.2841 10.9794 82.8514 11.7655C80.4188 12.5517 79.2025 13.7899 79.2025 15.4802C79.2025 17.2491 80.4391 18.4283 82.9123 19.0179C85.3855 19.6076 88.183 19.9024 91.3049 19.9024L97.9339 19.8434Z" fill="#FF550A"/>
            <path d="M186.923 2.1546V45.787H171.962V26.0935L162.049 45.787H148.244L137.662 25.8576V45.787H122.64V2.1546H139.79L155.116 32.1666L170.199 2.1546H186.923Z" fill="#FF550A"/>
            <path d="M32.2327 31.9884L40.5646 45.7857H23.536L0 2.15332H16.2988L32.2327 31.9884Z" fill="white"/>
          </svg>

        </nuxt-link>
        <Button rounded icon="pi pi-bars" label="Каталог" />
        <IconField style="flex-grow: 1">
          <InputText style="border-radius: 30px;width: 100%" v-model="value1" placeholder="Поиск по сайту VSM" />
          <InputIcon class="pi pi-search" />

        </IconField>
        <Button  rounded severity="secondary" icon="pi pi-cart" label="Корзина" />

      </div>

    </header>
  </div>
</template>

<style scoped>

</style>