<script setup lang="ts">
const {$api} = useNuxtApp()

const faq = ref([])

const feedback = [
  {date:'11 февраля 2025',text:'Приезжали выбрать материал. Большой ассортимент материала, приветливые менеджеры, стильный офис. Спасибо за консультацию и качественный товар. Рекомендуем',name:'Рустамбек Хамидов'},
  {date:'8 декабря 2024',text:'Хороший материал, отличные общительные менеджеры. Доставили вагонку с имитацией в срок! Спасибо большое',name:'Камила Зинатулина'},
  {date:'26 октября 2024',text:'Заказывал обрезные доски из сосны, по документам все быстро оформили, но вот отгрузка была на два дня позже обещанного!!! Степан заранее предупредил о задержке, технически неполадка всякое бывает',name:'Алексей Валерьевич К.'},
  {date:'3 сентября 2024',text:'Уже довольно давно занимаемся ремонтами квартир на профессиональном уровне. С этим магазином сотрудничаем уже больше года. Уже не одну квартиру закончили под ключ благодаря покупке и своевременной доставке материалов. Есть все как для внутренних работ, так и для ванной - клей, плитка, гидроизоляция. Менеджер всегда на связи и готов сформировать заказ под запросы. Ценник очень адекватный.',name:'Александр Пчелкин'},
  {date:'16 июня 2024',text:'Отличная компания, все быстро и в срок, был специфический цвет краски у меня ,так и ту приобрели и покрасили рейки в нужный цвет. Отдельно хочу поблагодарить и отметить работу менеджера Нозу. Однозначно рекомендую.',name:'Сергей Т.'},
]
onBeforeMount(async () => {
  faq.value = await $api('/api/data/faq')
})
</script>

<template>

  <section class="bg-[url(/offer-bg1.jpg)] bg-no-repeat bg-cover h-[600px] md:h-[900px] relative top-[-90px] md:top-[-140px] ">
    <div class="container text-white h-full ">
      <div class="flex flex-col items-start justify-between h-full py-20">


          <p class="w-full md:w-2/3 font-bold md:leading-[70px] mt-[60px] md:mt-[140px] mb-4 text-4xl md:text-7xl uppercase">НАТУРАЛЬНЫЕ ПИЛОМАТЕРИАЛЫ: ТЕПЛО ПРИРОДЫ В ВАШЕМ ДОМЕ</p>
        <div class="hidden md:flex gap-3 ">
          <p class="flex items-center gap-2 bg-white/10 font-medium border uppercase border-white/10 backdrop-blur-md px-4 py-2 rounded-[32px] text-white">
            <svg width="14" height="19" viewBox="0 0 14 19" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M11.1668 12.7042V18.4304C11.1668 18.6605 10.9802 18.8472 10.7502 18.8472C10.6747 18.8472 10.6006 18.8266 10.5358 18.7878L7.00016 16.6663L3.46454 18.7878C3.26721 18.9061 3.01127 18.8421 2.89287 18.6448C2.85402 18.58 2.8335 18.5059 2.8335 18.4304V12.7042C1.30939 11.4824 0.333496 9.60501 0.333496 7.49967C0.333496 3.81777 3.31826 0.833008 7.00016 0.833008C10.6821 0.833008 13.6668 3.81777 13.6668 7.49967C13.6668 9.60501 12.6909 11.4824 11.1668 12.7042ZM7.00016 12.4997C9.76158 12.4997 12.0002 10.2611 12.0002 7.49967C12.0002 4.73825 9.76158 2.49967 7.00016 2.49967C4.23874 2.49967 2.00016 4.73825 2.00016 7.49967C2.00016 10.2611 4.23874 12.4997 7.00016 12.4997ZM7.00016 10.833C5.15921 10.833 3.66683 9.34059 3.66683 7.49967C3.66683 5.65872 5.15921 4.16634 7.00016 4.16634C8.84108 4.16634 10.3335 5.65872 10.3335 7.49967C10.3335 9.34059 8.84108 10.833 7.00016 10.833Z" fill="white"/>
            </svg>
            5 лет ГАрантии
          </p>
          <p class="flex items-center gap-2 bg-white/10 font-medium border uppercase border-white/10 backdrop-blur-md px-4 py-2 rounded-[32px] text-white">
            <svg width="15" height="11" viewBox="0 0 15 11" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M5.33309 8.64274L12.9934 0.982422L14.1719 2.16093L5.33309 10.9997L0.0297852 5.69649L1.2083 4.51799L5.33309 8.64274Z" fill="white"/>
            </svg>
            17 лет на рынке
          </p>
          <p class="flex items-center gap-2 bg-white/10 font-medium border uppercase border-white/10 backdrop-blur-md px-4 py-2 rounded-[32px] text-white">
            <svg width="15" height="11" viewBox="0 0 15 11" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M5.33309 8.64274L12.9934 0.982422L14.1719 2.16093L5.33309 10.9997L0.0297852 5.69649L1.2083 4.51799L5.33309 8.64274Z" fill="white"/>
            </svg>
            СОБСТВЕННОЕ ПРОИЗВОДСТВО
          </p>
          <p class="flex items-center gap-2 bg-white/10 font-medium border uppercase border-white/10 backdrop-blur-md px-4 py-2 rounded-[32px] text-white">
            <svg width="15" height="11" viewBox="0 0 15 11" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M5.33309 8.64274L12.9934 0.982422L14.1719 2.16093L5.33309 10.9997L0.0297852 5.69649L1.2083 4.51799L5.33309 8.64274Z" fill="white"/>
            </svg>
            ДОСТАВКА ПО ВСЕЙ РФ
          </p>
        </div>


        <div class="grid grid-cols-1 md:grid-cols-2 w-full">
          <div class="flex flex-col md:flex-row items-end gap-4">
            <a href="https://wa.me/+79268994444" target="_blank" class="block w-full md:w-auto">
              <Button class="!px-6 !py-3 w-full md:w-auto"   rounded label="Рассчитать стоимость для вас" />
            </a>

            <a href="https://wa.me/+79268994444" target="_blank" class="p-button p-component p-button-secondary p-button-rounded !px-4  !py-3 w-full md:w-auto !text-black">
              <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M10.0005 0C15.5233 0 20.0005 4.47715 20.0005 10C20.0005 15.5228 15.5233 20 10.0005 20C8.16661 20 6.44802 19.5064 4.97037 18.6447L0.00466847 20L1.35663 15.0315C0.494448 13.5536 0.000488281 11.8345 0.000488281 10C0.000488281 4.47715 4.47764 0 10.0005 0ZM6.39183 5.30833C6.26244 5.31742 6.13558 5.34902 6.02008 5.40811C5.93343 5.45244 5.85299 5.51651 5.7266 5.63586C5.60725 5.74855 5.53808 5.84697 5.4652 5.94186C5.0955 6.4232 4.8968 7.01405 4.90049 7.62098C4.9025 8.1116 5.02994 8.5884 5.2312 9.0336C5.63933 9.9364 6.31239 10.8908 7.20145 11.7759C7.41501 11.9885 7.62424 12.2034 7.84985 12.402C8.95331 13.3736 10.2683 14.0742 11.6902 14.4482C11.6902 14.4482 12.2502 14.5342 12.2584 14.5347C12.4439 14.5447 12.6291 14.5313 12.8148 14.5218C13.1061 14.5068 13.3905 14.428 13.6479 14.2909C13.8134 14.2028 13.8917 14.159 14.0306 14.0714C14.0306 14.0714 14.0732 14.0426 14.1554 13.9814C14.2904 13.8808 14.3738 13.81 14.4861 13.6934C14.5689 13.6074 14.6401 13.5058 14.6951 13.3913C14.7733 13.2281 14.852 12.9166 14.8833 12.6579C14.9072 12.4603 14.9 12.3523 14.8974 12.2854C14.8931 12.1778 14.8042 12.0671 14.7068 12.0201L14.1253 11.7587C14.1253 11.7587 13.2558 11.3803 12.724 11.1377C12.6686 11.1124 12.608 11.1007 12.5471 11.097C12.4137 11.0888 12.2642 11.1236 12.1691 11.2238C12.1641 11.2218 12.0979 11.279 11.3744 12.1555C11.3345 12.2032 11.241 12.3069 11.0793 12.2972C11.0549 12.2955 11.0306 12.292 11.0069 12.2858C10.9414 12.2685 10.8776 12.2457 10.8152 12.2193C10.6915 12.1668 10.6481 12.1469 10.5636 12.1105C9.98631 11.8583 9.45651 11.5209 8.98821 11.108C8.86261 10.9974 8.74581 10.8783 8.62541 10.7616C8.20521 10.3543 7.8612 9.9211 7.60528 9.4938C7.59131 9.4705 7.56978 9.4368 7.54659 9.3991C7.50472 9.331 7.45854 9.25 7.44406 9.1944C7.40689 9.0473 7.5055 8.9291 7.5055 8.9291C7.5055 8.9291 7.7489 8.663 7.86199 8.5183C7.97079 8.379 8.06471 8.2428 8.12451 8.1457C8.24231 7.95633 8.27961 7.76062 8.21771 7.60963C7.93715 6.92565 7.64769 6.24536 7.34937 5.56894C7.29049 5.43545 7.11536 5.33846 6.9561 5.32007C6.90216 5.31384 6.84826 5.30758 6.7941 5.30402C6.66004 5.29748 6.52571 5.29892 6.39183 5.30833Z" fill="black"/>
              </svg>
              Мы в WhatsApp
            </a>
            <a href="https://t.me/vsmprom" target="_blank" class="p-button p-component p-button-secondary p-button-rounded  !px-4 !py-3 w-full md:w-auto !text-black">
              <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M24 12C24 18.6274 18.6274 24 12 24C5.37258 24 0 18.6274 0 12C0 5.37258 5.37258 0 12 0C18.6274 0 24 5.37258 24 12ZM12.4301 8.85895C11.2628 9.34442 8.93016 10.3493 5.43192 11.8734C4.86385 12.0992 4.56629 12.3203 4.53919 12.5363C4.49341 12.9016 4.95073 13.0453 5.5735 13.2412C5.6582 13.2678 5.74598 13.2954 5.83596 13.3247C6.44866 13.5238 7.27285 13.7568 7.70131 13.766C8.08997 13.7744 8.52376 13.6142 9.00266 13.2853C12.2712 11.079 13.9584 9.96384 14.0644 9.93984C14.1391 9.9228 14.2427 9.90156 14.3128 9.96384C14.383 10.0262 14.376 10.1443 14.3687 10.176C14.3233 10.3692 12.5281 12.0382 11.5992 12.9018C11.3221 13.1593 11.0521 13.4224 10.78 13.6847C10.2108 14.2333 9.78396 14.6448 10.8036 15.3168C11.8373 15.998 12.8788 16.6778 13.8869 17.3965C14.384 17.751 14.8308 18.0695 15.3826 18.0187C15.7033 17.9892 16.0345 17.6876 16.2026 16.7884C16.6002 14.6632 17.3816 10.0585 17.5622 8.161C17.5781 7.99476 17.5582 7.782 17.5422 7.6886C17.5262 7.59521 17.4928 7.46213 17.3714 7.36362C17.2276 7.24696 17.0057 7.22236 16.9064 7.22411C16.455 7.23206 15.7626 7.47284 12.4301 8.85895Z" fill="black"/>
              </svg>

              Мы в Telegram
            </a>

          </div>
          <div class="hidden md:flex items-end gap-4 justify-self-end">
            <img src="~assets/of1.png" alt="">
            <img src="~assets/of2.png" alt="">
          </div>
        </div>
      </div>

    </div>
  </section>
  <section class="pb-[60px] md:pb-[120px]">
    <div class="container">
      <div class="flex items-center justify-between mb-10">
        <div class="">
          <p class="font-bold text-3xl md:text-7xl uppercase">Каталог</p>
        </div>
        <div class="hidden md:block">
          <svg width="79" height="56" viewBox="0 0 79 56" fill="none" xmlns="http://www.w3.org/2000/svg">
            <circle cx="22" cy="28" r="22" fill="#0F4B29"/>
            <circle cx="51" cy="28" r="25" fill="#FF550A" stroke="white" stroke-width="6"/>
          </svg>
        </div>


      </div>
      <Catalog/>
    </div>
  </section>
  <section class="bg-[#efefef] py-[60px] md:py-[120px]">
    <div class="container">
      <div class="flex items-center justify-between mb-10">
        <div class="">
          <p class="font-bold text-3xl md:text-7xl uppercase">Породы</p>
        </div>
        <div class="hidden md:block">
          <svg width="79" height="56" viewBox="0 0 79 56" fill="none" xmlns="http://www.w3.org/2000/svg">
            <circle cx="22" cy="28" r="22" fill="#0F4B29"/>
            <circle cx="51" cy="28" r="25" fill="#FF550A" stroke="white" stroke-width="6"/>
          </svg>
        </div>


      </div>
     <Materials/>
    </div>

  </section>
  <section class="py-[60px] md:py-[120px]">
    <div class="container">
      <div class="flex items-center justify-between mb-10">
        <div class="">
          <p class="font-bold text-3xl md:text-7xl uppercase">НАШИ Преимущества</p>
        </div>
        <div class="hidden md:block">
          <svg width="79" height="56" viewBox="0 0 79 56" fill="none" xmlns="http://www.w3.org/2000/svg">
            <circle cx="22" cy="28" r="22" fill="#0F4B29"/>
            <circle cx="51" cy="28" r="25" fill="#FF550A" stroke="white" stroke-width="6"/>
          </svg>
        </div>


      </div>
      <div class="grid grid-cols-1 md:grid-cols-4 gap-3">
        <div class="border p-8">
          <div class="mb-16 md:mb-32">
            <svg width="72" height="72" viewBox="0 0 72 72" fill="none" xmlns="http://www.w3.org/2000/svg">
              <rect width="72" height="72" rx="20" fill="#EFEFEF"/>
              <path d="M36 47.25C37.4774 47.25 38.9403 46.959 40.3052 46.3936C41.6701 45.8283 42.9103 44.9996 43.955 43.955C44.9996 42.9103 45.8283 41.6701 46.3936 40.3052C46.959 38.9403 47.25 37.4774 47.25 36C47.25 34.5226 46.959 33.0597 46.3936 31.6948C45.8283 30.3299 44.9996 29.0897 43.955 28.045C42.9103 27.0004 41.6701 26.1717 40.3052 25.6064C38.9403 25.041 37.4774 24.75 36 24.75C33.0163 24.75 30.1548 25.9353 28.045 28.045C25.9353 30.1548 24.75 33.0163 24.75 36C24.75 38.9837 25.9353 41.8452 28.045 43.955C30.1548 46.0647 33.0163 47.25 36 47.25ZM49.75 36C49.75 43.5938 43.5938 49.75 36 49.75C28.4062 49.75 22.25 43.5938 22.25 36C22.25 28.4062 28.4062 22.25 36 22.25C43.5938 22.25 49.75 28.4062 49.75 36ZM39.75 41.5175L34.75 36.5175V27.875H37.25V35.4825L41.5175 39.75L39.75 41.5175Z" fill="black"/>
            </svg>

          </div>
          <p class="text-3xl uppercase font-medium">СОБЛЮДЕНИЕ СРОКОВ ПОСТАВКИ</p>
        </div>
        <div class="border p-8">
          <div class="mb-16 md:mb-32">
            <svg width="72" height="72" viewBox="0 0 72 72" fill="none" xmlns="http://www.w3.org/2000/svg">
              <rect width="72" height="72" rx="20" fill="#EFEFEF"/>
              <path d="M36 22.875L39.875 30.75L48.5 32L42.25 38L43.75 46.625L36 42.625L28.25 46.625L29.75 38L23.5 32L32.125 30.75L36 22.875Z" stroke="black" stroke-width="2.5" stroke-linecap="round" stroke-linejoin="round"/>
            </svg>

          </div>
          <p class="text-3xl uppercase font-medium">гарантия качества продукции</p>
        </div>
        <div class="border p-8">
          <div class="mb-16 md:mb-32">
            <svg width="72" height="72" viewBox="0 0 72 72" fill="none" xmlns="http://www.w3.org/2000/svg">
              <rect width="72" height="72" rx="20" fill="#EFEFEF"/>
              <path d="M24.4147 46.6097V41.4146C23.8415 41.6219 23.2318 41.7317 22.5854 41.7317C19.5367 41.7317 17.0977 39.2927 17.0977 36.2439C17.0977 34.6951 17.7074 33.3049 18.7562 32.3049C18.4757 31.6464 18.3172 30.9146 18.3172 30.1464C18.3172 27.0976 20.7562 24.6586 23.805 24.6586C25.7074 24.6586 27.3903 25.6342 28.3781 27.0976H28.683C29.5638 27.0976 30.436 27.2711 31.2498 27.6081C32.0635 27.9452 32.8029 28.4393 33.4258 29.0621C34.0486 29.6849 34.5426 30.4243 34.8797 31.2381C35.2168 32.0519 35.3903 32.9241 35.3903 33.8049C35.3903 34.6857 35.2168 35.5579 34.8797 36.3717C34.5426 37.1854 34.0486 37.9248 33.4258 38.5477C32.8029 39.1705 32.0635 39.6645 31.2498 40.0016C30.436 40.3387 29.5638 40.5122 28.683 40.5122C28.0732 40.5122 27.4635 40.4268 26.8537 40.2561V46.6097H24.4147Z" fill="black"/>
              <path d="M56.1217 42.9508L51.2437 36.8533H54.9022L50.0242 30.7558H52.4632L46.3657 23.4387L40.2681 30.7558H42.7072L37.8291 36.8533H41.4877L36.6096 42.9508H45.1462V47.8289H47.5852V42.9508H56.1217Z" fill="black"/>
            </svg>


          </div>
          <p class="text-3xl uppercase font-medium">широкий ассортимент</p>
        </div>
        <div class="border p-8">
          <div class="mb-16 md:mb-32">
            <svg width="72" height="72" viewBox="0 0 72 72" fill="none" xmlns="http://www.w3.org/2000/svg">
              <rect width="72" height="72" rx="20" fill="#EFEFEF"/>
              <path d="M23.5 24.75V23.5C23.1685 23.5 22.8505 23.6317 22.6161 23.8661C22.3817 24.1005 22.25 24.4185 22.25 24.75H23.5ZM37.25 24.75H38.5C38.5 24.4185 38.3683 24.1005 38.1339 23.8661C37.8995 23.6317 37.5815 23.5 37.25 23.5V24.75ZM37.25 32.25V31C36.9185 31 36.6005 31.1317 36.3661 31.3661C36.1317 31.6005 36 31.9185 36 32.25H37.25ZM23.5 26H37.25V23.5H23.5V26ZM36 24.75V44.75H38.5V24.75H36ZM24.75 42.25V24.75H22.25V42.25H24.75ZM37.25 33.5H43.5V31H37.25V33.5ZM47.25 37.25V42.25H49.75V37.25H47.25ZM38.5 44.75V32.25H36V44.75H38.5ZM44.3838 45.6338C44.1493 45.8681 43.8315 45.9997 43.5 45.9997C43.1685 45.9997 42.8507 45.8681 42.6162 45.6338L40.8487 47.4013C41.552 48.1043 42.5056 48.4992 43.5 48.4992C44.4944 48.4992 45.448 48.1043 46.1513 47.4013L44.3838 45.6338ZM42.6162 43.8662C42.8507 43.6319 43.1685 43.5003 43.5 43.5003C43.8315 43.5003 44.1493 43.6319 44.3838 43.8662L46.1513 42.0987C45.448 41.3957 44.4944 41.0008 43.5 41.0008C42.5056 41.0008 41.552 41.3957 40.8487 42.0987L42.6162 43.8662ZM29.3837 45.6338C29.1493 45.8681 28.8315 45.9997 28.5 45.9997C28.1685 45.9997 27.8507 45.8681 27.6163 45.6338L25.8487 47.4013C26.552 48.1043 27.5056 48.4992 28.5 48.4992C29.4944 48.4992 30.448 48.1043 31.1513 47.4013L29.3837 45.6338ZM27.6163 43.8662C27.8507 43.6319 28.1685 43.5003 28.5 43.5003C28.8315 43.5003 29.1493 43.6319 29.3837 43.8662L31.1513 42.0987C30.448 41.3957 29.4944 41.0008 28.5 41.0008C27.5056 41.0008 26.552 41.3957 25.8487 42.0987L27.6163 43.8662ZM44.3838 43.8662C44.6288 44.11 44.75 44.4287 44.75 44.75H47.25C47.25 43.7925 46.8838 42.83 46.1513 42.0987L44.3838 43.8662ZM44.75 44.75C44.7499 45.0815 44.6182 45.3994 44.3838 45.6338L46.1513 47.4013C46.8546 46.6982 47.2498 45.7445 47.25 44.75H44.75ZM41 43.5H37.25V46H41V43.5ZM42.6162 45.6338C42.3818 45.3994 42.2501 45.0815 42.25 44.75H39.75C39.75 45.7075 40.1162 46.67 40.8487 47.4013L42.6162 45.6338ZM42.25 44.75C42.2501 44.4185 42.3818 44.1006 42.6162 43.8662L40.8487 42.0987C40.1454 42.8018 39.7502 43.7555 39.75 44.75H42.25ZM27.6163 45.6338C27.3818 45.3994 27.2501 45.0815 27.25 44.75H24.75C24.75 45.7075 25.1162 46.67 25.8487 47.4013L27.6163 45.6338ZM27.25 44.75C27.2501 44.4185 27.3818 44.1006 27.6163 43.8662L25.8487 42.0987C25.1454 42.8018 24.7502 43.7555 24.75 44.75H27.25ZM37.25 43.5H31V46H37.25V43.5ZM29.3837 43.8662C29.6287 44.11 29.75 44.4287 29.75 44.75H32.25C32.25 43.7925 31.8837 42.83 31.1513 42.0987L29.3837 43.8662ZM29.75 44.75C29.7499 45.0815 29.6182 45.3994 29.3837 45.6338L31.1513 47.4013C31.8546 46.6982 32.2498 45.7445 32.25 44.75H29.75ZM47.25 42.25C47.25 42.5815 47.1183 42.8995 46.8839 43.1339C46.6495 43.3683 46.3315 43.5 46 43.5V46C46.9946 46 47.9484 45.6049 48.6517 44.9017C49.3549 44.1984 49.75 43.2446 49.75 42.25H47.25ZM43.5 33.5C44.4946 33.5 45.4484 33.8951 46.1517 34.5983C46.8549 35.3016 47.25 36.2554 47.25 37.25H49.75C49.75 36.4292 49.5883 35.6165 49.2742 34.8582C48.9602 34.0999 48.4998 33.4109 47.9194 32.8306C47.3391 32.2502 46.6501 31.7898 45.8918 31.4758C45.1335 31.1617 44.3208 31 43.5 31V33.5ZM22.25 42.25C22.25 43.2446 22.6451 44.1984 23.3483 44.9017C24.0516 45.6049 25.0054 46 26 46V43.5C25.6685 43.5 25.3505 43.3683 25.1161 43.1339C24.8817 42.8995 24.75 42.5815 24.75 42.25H22.25Z" fill="black"/>
            </svg>


          </div>
          <p class="text-3xl uppercase font-medium">доставка в любые регионы</p>
        </div>
      </div>
    </div>
  </section>
  <section class="bg-[#efefef] py-[60px] md:py-[120px]">
    <div class="container">
      <div class="flex items-center justify-between mb-10">
        <div class="">
          <p class="font-bold text-3xl md:text-7xl uppercase">Отзывы</p>
        </div>
        <div class="hidden md:block">
          <svg width="79" height="56" viewBox="0 0 79 56" fill="none" xmlns="http://www.w3.org/2000/svg">
            <circle cx="22" cy="28" r="22" fill="#0F4B29"/>
            <circle cx="51" cy="28" r="25" fill="#FF550A" stroke="white" stroke-width="6"/>
          </svg>
        </div>
      </div>
      <div class="grid grid-cols-1 md:grid-cols-5 gap-3">
        <div class="p-10 bg-white rounded-[10px]" v-for="item in feedback">
            <p class="font-medium opacity-50 mb-5">{{item.date}}</p>

          <svg class="mb-5" width="140" height="28" viewBox="0 0 140 28" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M13.5245 1.46352C13.6741 1.00287 14.3259 1.00287 14.4755 1.46353L17.0309 9.32827C17.0979 9.53428 17.2899 9.67376 17.5065 9.67376H25.776C26.2603 9.67376 26.4617 10.2936 26.0698 10.5783L19.3797 15.439C19.2044 15.5663 19.1311 15.792 19.1981 15.998L21.7535 23.8627C21.9031 24.3234 21.3759 24.7064 20.984 24.4217L14.2939 19.5611C14.1186 19.4337 13.8814 19.4337 13.7061 19.5611L7.01595 24.4217C6.6241 24.7064 6.09686 24.3234 6.24653 23.8627L8.80194 15.998C8.86888 15.792 8.79555 15.5663 8.62031 15.439L1.93016 10.5783C1.5383 10.2936 1.73969 9.67376 2.22405 9.67376H10.4935C10.7101 9.67376 10.9021 9.53428 10.9691 9.32827L13.5245 1.46352Z" fill="#EB5939"/>
            <path d="M41.5245 1.46352C41.6741 1.00287 42.3259 1.00287 42.4755 1.46353L45.0309 9.32827C45.0979 9.53428 45.2899 9.67376 45.5065 9.67376H53.776C54.2603 9.67376 54.4617 10.2936 54.0698 10.5783L47.3797 15.439C47.2044 15.5663 47.1311 15.792 47.1981 15.998L49.7535 23.8627C49.9031 24.3234 49.3759 24.7064 48.984 24.4217L42.2939 19.5611C42.1186 19.4337 41.8814 19.4337 41.7061 19.5611L35.016 24.4217C34.6241 24.7064 34.0969 24.3234 34.2465 23.8627L36.8019 15.998C36.8689 15.792 36.7956 15.5663 36.6203 15.439L29.9302 10.5783C29.5383 10.2936 29.7397 9.67376 30.224 9.67376H38.4935C38.7101 9.67376 38.9021 9.53428 38.9691 9.32827L41.5245 1.46352Z" fill="#EB5939"/>
            <path d="M69.5245 1.46352C69.6741 1.00287 70.3259 1.00287 70.4755 1.46353L73.0309 9.32827C73.0979 9.53428 73.2899 9.67376 73.5065 9.67376H81.776C82.2603 9.67376 82.4617 10.2936 82.0698 10.5783L75.3797 15.439C75.2044 15.5663 75.1311 15.792 75.1981 15.998L77.7535 23.8627C77.9031 24.3234 77.3759 24.7064 76.984 24.4217L70.2939 19.5611C70.1186 19.4337 69.8814 19.4337 69.7061 19.5611L63.016 24.4217C62.6241 24.7064 62.0969 24.3234 62.2465 23.8627L64.8019 15.998C64.8689 15.792 64.7956 15.5663 64.6203 15.439L57.9302 10.5783C57.5383 10.2936 57.7397 9.67376 58.224 9.67376H66.4935C66.7101 9.67376 66.9021 9.53428 66.9691 9.32827L69.5245 1.46352Z" fill="#EB5939"/>
            <path d="M97.5245 1.46352C97.6741 1.00287 98.3259 1.00287 98.4755 1.46353L101.031 9.32827C101.098 9.53428 101.29 9.67376 101.506 9.67376H109.776C110.26 9.67376 110.462 10.2936 110.07 10.5783L103.38 15.439C103.204 15.5663 103.131 15.792 103.198 15.998L105.753 23.8627C105.903 24.3234 105.376 24.7064 104.984 24.4217L98.2939 19.5611C98.1186 19.4337 97.8814 19.4337 97.7061 19.5611L91.016 24.4217C90.6241 24.7064 90.0969 24.3234 90.2465 23.8627L92.8019 15.998C92.8689 15.792 92.7956 15.5663 92.6203 15.439L85.9302 10.5783C85.5383 10.2936 85.7397 9.67376 86.224 9.67376H94.4935C94.7101 9.67376 94.9021 9.53428 94.9691 9.32827L97.5245 1.46352Z" fill="#EB5939"/>
            <path d="M125.524 1.46352C125.674 1.00287 126.326 1.00287 126.476 1.46353L129.031 9.32827C129.098 9.53428 129.29 9.67376 129.506 9.67376H137.776C138.26 9.67376 138.462 10.2936 138.07 10.5783L131.38 15.439C131.204 15.5663 131.131 15.792 131.198 15.998L133.753 23.8627C133.903 24.3234 133.376 24.7064 132.984 24.4217L126.294 19.5611C126.119 19.4337 125.881 19.4337 125.706 19.5611L119.016 24.4217C118.624 24.7064 118.097 24.3234 118.247 23.8627L120.802 15.998C120.869 15.792 120.796 15.5663 120.62 15.439L113.93 10.5783C113.538 10.2936 113.74 9.67376 114.224 9.67376H122.494C122.71 9.67376 122.902 9.53428 122.969 9.32827L125.524 1.46352Z" fill="#EB5939"/>
          </svg>
          <div class="flex flex-col items-start justify-between h-auto md:h-[85%]">
            <p class="leading-[22px] font-semibold text-lg mb-4 md:mb-0">
              {{item.text}}
            </p>
            <p class="font-medium opacity-50">{{item.name}}</p>
          </div>

        </div>
      </div>
    </div>
  </section>
  <section class="py-[60px] md:py-[120px]">
    <div class="container">
      <div class="flex items-center justify-between mb-10">
        <div class="">
          <p class="font-bold text-3xl md:text-7xl uppercase">Наши работы</p>
        </div>
        <div class="hidden md:block">
          <svg width="79" height="56" viewBox="0 0 79 56" fill="none" xmlns="http://www.w3.org/2000/svg">
            <circle cx="22" cy="28" r="22" fill="#0F4B29"/>
            <circle cx="51" cy="28" r="25" fill="#FF550A" stroke="white" stroke-width="6"/>
          </svg>
        </div>


      </div>

      <div class="masonry-grid">

        <img src="~assets/img/XXXL.png" class="w-full" alt="">
        <img src="~assets/img/XXXL%20(1).png" class="w-full" alt="">
        <img src="~assets/img/XXXL%20(2).png" class="w-full" alt="">
        <img src="~assets/img/XXXL%20(3).png" class="w-full" alt="">
        <img src="~assets/img/XXXL%20(4).png" class="w-full" alt="">


      </div>
    </div>
  </section>
  <section class="py-[60px] md:py-[120px]">
    <div class="container">
      <div class="flex items-center justify-between mb-10">
        <div class="">
          <p class="font-bold text-3xl md:text-7xl uppercase">УСЛУГИ</p>
        </div>
        <div class="hidden md:block">
          <svg width="79" height="56" viewBox="0 0 79 56" fill="none" xmlns="http://www.w3.org/2000/svg">
            <circle cx="22" cy="28" r="22" fill="#0F4B29"/>
            <circle cx="51" cy="28" r="25" fill="#FF550A" stroke="white" stroke-width="6"/>
          </svg>
        </div>
      </div>
     <Services/>
    </div>
  </section>
  <section class="py-[60px] md:py-[120px]">
    <div class="container">
      <div class="flex items-center justify-between mb-10">
        <div class="">
          <p class="font-bold text-3xl md:text-7xl uppercase">FAQ</p>
        </div>
        <div class="hidden md:block">
          <svg width="79" height="56" viewBox="0 0 79 56" fill="none" xmlns="http://www.w3.org/2000/svg">
            <circle cx="22" cy="28" r="22" fill="#0F4B29"/>
            <circle cx="51" cy="28" r="25" fill="#FF550A" stroke="white" stroke-width="6"/>
          </svg>
        </div>


      </div>

      <div class="grid grid-cols-1 md:grid-cols-2 gap-4">
        <div class="">
          <img class="w-full h-full object-cover" src="~assets/faq.png" alt="">
        </div>
        <Accordion >
          <AccordionPanel :value="item.id" v-for="item in faq" :key="item.id">
            <AccordionHeader>{{item.question}}</AccordionHeader>
            <AccordionContent>
              <p class="m-0">
                {{item.answer}}
            </p>
            </AccordionContent>
          </AccordionPanel>

        </Accordion>
      </div>
    </div>
  </section>
</template>

<style>
.masonry-grid {
  column-count: 3; /* Количество колонок */
  column-gap: 1rem; /* Расстояние между колонками */
}
.masonry-grid img {
  display: block;
  width: 100%;
  margin-bottom: 1rem; /* Расстояние между изображениями */
}
</style>